'''
Найти сумму элементов каждого столбца матрицы 
'''

spisok =  [[0.55,  0.59,  0.72,  0.84,  0.60,  0.86,  0.54],
[0.85,  0.42,  0.62,  0.65,  0.38,  0.44,  0.30],
[0.89,  0.06,  0.96,  0.27,  0.38,  0.48,  0.79],
[0.81,  0.53,  0.48,  0.57,  0.39,  0.93,  0.84],
[0.07,  0.34,  0.09,  0.65,  0.02,  0.37,  0.83]
]

summa = [0, 0, 0, 0, 0, 0, 0]

for i in range(5):
    for j in range(7):
        summa[j] = summa[j] + spisok[i][j]
    
    
for elem in summa:
    elem = round(elem*100)/100
    print(elem, end = " ")