'''
Найдите в наборе (в рюкзаке) элемент "пирожок",
выведите номер последнего пирожка в наборе
'''

# решение 1, без списков
'''
n = int(input("Введите количество: "))
number = -1

for step in range(1, n+1):
    word = input("Введите слово: ")
    if word == "пирожок":
        number = step

if number == -1:
    print("Не найдено")
else:
    print("Последний пирожок находится под номером", step)
'''
#решение 2 через списки
spisok = ["огонь", "вода", "пирожок", "земля", "небо", "пирожок", "БООООООРЩ"]
nomer = -1

for i in range(len(spisok)-1, -1, -1):
    if spisok[i] == "пирожок":
        nomer = i + 1
        break

if nomer == -1:
    print("Не найдено")
else:
    print("Последний пирожок находится под номером", nomer)
