"""
Выведите числа от 10 до 0: 10, 9, 8 и т.д.
"""
'''
# Решение через for
for step in range(10, -1, -1):
    print(step)
    
'''    
# Решение через while
'''
step = 10

while step >= 0:
    print(step)
    step = step - 1
'''    
